Autodesk.Revit.DB.Infrastructure.AlignmentServiceRequest
An enumerated type containing possible requests for an IAlignmentServer
Since:
2021
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceRequest.GetOrCreateDefaultLabelSetType
Get the type with default settings for creating a label set.
If one does not exist, create it.

Autodesk.Revit.DB.Infrastructure.AlignmentServiceRequest.SetInSessionDefaultLabelSetTypeId
Set in-session default type for creating a label set

Autodesk.Revit.DB.Infrastructure.AlignmentServiceRequest.GetInSessionDefaultLabelSetTypeId
Get in-session default type for creating a label set

Autodesk.Revit.DB.Infrastructure.AlignmentServiceRequest.GetValuesByStation
Get distance and point on geometry by station

Autodesk.Revit.DB.Infrastructure.AlignmentServiceRequest.GetValuesByPoint
Get distance, station value and point on geometry by point

Autodesk.Revit.DB.Infrastructure.AlignmentServiceRequest.GetValuesByDistance
Get station value and point on geometry by alignment distance